---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.WireTypes
source: html/2cf6315a-b891-db9d-677a-89a8d73dd7cf.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.WireTypes Property

Get all wire type definition information of the project.

## Syntax (C#)
```csharp
public WireTypeSet WireTypes { get; }
```